export default {
  pageTitle: {
    main: '모니터 픽셀 테스트',
    testing: '모니터 테스트 진행 중 👻'
  },
  openGraph: {
    title: 'Dewdew | 모니터 픽셀 테스트',
    description: '심플하고 간단한 모니터 테스트 입니다. 필요한 항목을 선택하고 테스트를 진행하세요. 아무런 간섭 없는 가벼운 테스트 웹페이지 입니다.'
  },
  localeMenu: {
    ko: '한글',
    en: 'English'
  },
  button: {
    home: '홈',
    back: '뒤로가기',
    guide: '이용 가이드',
    start: '모니터 테스트 시작하기',
    fullScreen: '전체화면',
    exitFullScreen: '전체화면 종료',
    disableAll: '모두 비활성화',
    confirm: '확인'
  },
  tooltip: {
    disableAll: '모든 테스트 선택 항목을 비활성화합니다.'
  },
  messages: {
    selectItem: '테스트를 진행할 항목을 선택하세요.',
    error: '페이지를 찾을 수 없어요.. 홈으로 돌아갑시다!'
  },
  index: {
    title: '모니터 테스트',
    subTitle: '테스트를 진행할 항목을 선택하고 테스트 시작하기를 누르세요.'
  },
  guide: {
    title: '모니터 테스트 이용방법 안내입니다.',
    steps: [
      {
        title: '테스트 항목을 선택합니다.',
        description: [
          '테스트를 진행할 항목을 선택합니다!',
          '모든 항목을 선택하셔도 좋고, 원하는 항목만 선택하셔도 좋습니다.',
          '그리고 모든 항목을 삭제할 수 있습니다.'
        ]
      },
      {
        title: '테스트를 진행합니다.',
        description: [
          '테스트를 시작하면, 자동으로 전체화면으로 전환됩니다.',
          '전체화면에서 해제하려면, Esc 키를 누르거나, 전체화면 버튼을 누르면 됩니다.',
          '테스트 진행하면, 각 네비게이터는 3초 뒤에 자동으로 숨겨지며, 마우스를 움직이면 다시 나타납니다.'
        ]
      },
      {
        title: '테스트를 완료합니다!',
        description: [
          '우측 하단의 선택항목을 계속 선택하다보면, 테스트가 완료되며 메인으로 돌아갑니다.',
          '최초의 항목으로 돌아왔으면, 뒤로가기를 한번 더 눌러서 종료할 수 있습니다.'
        ]
      },
      {
        title: '테스트가 도움이 되었다면, 공유해주세요!',
        description: [
          '유용했다면, 널리 공유해주시면 감사하겠습니다!',
          '또한, 더 많은 좋은 기능을 개발하기위해 개발자에게 맛있는 커피 한잔을 사주세요!'
        ]
      }
    ]
  },
  testing: {
    defective: {
      title: '불량 픽셀',
      description: '흰색 화면에서 검은점이 보이면 불량 픽셀입니다.'
    },
    black: {
      title: '검은색 테스트',
      description: '검은색 화면에서 다른색 픽셀이 보이면 불량 픽셀입니다.'
    },
    red: {
      title: '빨간색 테스트',
      description: '빨간색 화면에서 다른색 픽셀이 불량 픽셀입니다.'
    },
    green: {
      title: '초록색 테스트',
      description: '초록색 화면에서 다른색 픽셀이 불량 픽셀입니다.'
    },
    blue: {
      title: '파란색 테스트',
      description: '파란색 화면에서 다른색 픽셀이 불량 픽셀입니다.'
    },
    uniformity: {
      title: '균일성 테스트',
      description: '회색 색상의 alpha값 변경을 통해 균일성을 확인합니다.',
      boxTitle: '회색의 농도를 조절합니다.'
    },
    colorDistance: {
      title: '색간격 테스트',
      description: '내부 박스와 외부 박스의 색간 간격을 확인합니다.',
      boxInner: '박스 내부의 색상을 조절합니다.',
      boxOuter: '박스 외부의 색상을 조절합니다.'
    },
    gradient: {
      title: '그라데이션 테스트',
      description: '그라데이션 단계와 색상을 선택하고 테스트를 진행합니다.',
      boxTitle: '그라디언트 테스트를 진행합니다.'
    },
    sharpness: {
      title: '선명도 테스트',
      description: '글자를 통해 폰트가 선명하게 표시되는지 테스트합니다.',
      boxTitle: '글자크기와 색상을 반전합니다.',
      boxText: '유구한 역사와 전통에 빛나는 우리 대한국민은 3ㆍ1운동으로 건립된 대한민국임시정부의 법통과 불의에 항거한 4ㆍ19민주이념을 계승하고, 조국의 민주개혁과 평화적 통일의 사명에 입각하여 정의ㆍ인도와 동포애로써 민족의 단결을 공고히 하고, 모든 사회적 폐습과 불의를 타파하며, 자율과 조화를 바탕으로 자유민주적 기본질서를 더욱 확고히 하여 정치ㆍ경제ㆍ사회ㆍ문화의 모든 영역에 있어서 각인의 기회를 균등히 하고, 능력을 최고도로 발휘하게 하며, 자유와 권리에 따르는 책임과 의무를 완수하게 하여, 안으로는 국민생활의 균등한 향상을 기하고 밖으로는 항구적인 세계평화와 인류공영에 이바지함으로써 우리들과 우리들의 자손의 안전과 자유와 행복을 영원히 확보할 것을 다짐하면서 1948년 7월 12일에 제정되고 8차에 걸쳐 개정된 헌법을 이제 국회의 의결을 거쳐 국민투표에 의하여 개정한다.'
    }
  }
}
